{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c1bb9934-64e2-422a-aece-26c44564c53e",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# the endpoint generated by the cloudformation stack for neptune\n",
    "endpoint = 'to be copied here'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c99ddcc9-6010-44cd-a4cb-22b0560f16da",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.driver.aiohttp.transport import AiohttpTransport\n",
    "from gremlin_python.process.traversal import *\n",
    "from gremlin_python.process.graph_traversal import id_\n",
    "import os\n",
    "import tracemalloc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "1a54c2a5-d498-487e-8be9-e6c1da5caf2b",
   "metadata": {
    "jupyter": {
     "source_hidden": true
    },
    "tags": []
   },
   "outputs": [],
   "source": [
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "\n",
    "# Create a connection to AWS Neptune\n",
    "endpoint = endpoint\n",
    "graph = Graph()\n",
    "connection = DriverRemoteConnection(endpoint, 'g')\n",
    "g = graph.traversal().withRemote(connection)\n",
    "tracemalloc.start()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "cd27cae0-9aad-47cc-a1fa-46ea561d4e1e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "a913ca368cde40eb82c907e5653a6045",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().count().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "7f434bc3-ddca-4979-a580-f1f416a1443a",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "5021c176bb824c6bbea06ea83ad3c1b4",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.E().count().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "8f22769f-1f97-4e03-b3a3-aa62e44f4b42",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "ed4a2f84f3344d34a7a36fe668900c6c",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().groupCount().by(label).unfold().order().by(keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "ae383337-74bb-4105-8c4a-6acf93edde42",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d928cc44c572499593543cec4dcbd9f7",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.E().groupCount().by(label).unfold().order().by(keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "4240519a-2dba-401c-81f2-4860848672f0",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1f3d556dc4564ed4bc7bcbe39a7107cc",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().values('user_attr_1').mean().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "13b6adf4-5d33-4957-8e32-db897a0d4a6e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "bd0c4d701af246e9be510e097b1e9c7e",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().values('user_attr_1').min().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "ededeb32-e1f5-4b29-bf03-e7dc557ad960",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Find the distinct values of a property in vertices\n",
    "distinct_values = g.V().values('user_attr_1').dedup().toList()\n",
    "#print(\"Distinct values:\", distinct_values)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "76a5b6da-e855-49d2-b120-374dd7a8ea2e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "36ddedd0a4f740a0866c30656bd1162f",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().hasLabel('user').properties().count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "f99bb270-0d9c-4b44-bef2-332306bab4fb",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "94350089837047a78063cad0dec93478",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().hasLabel('user').properties().key().dedup().count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "c1fd63ad-f0ad-4f38-9e5c-4832d2d7fc51",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "948b6027c6dc4d9ebf4c02328af1a6cb",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().hasLabel('cell').properties().key().dedup().count() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "4b96732c-f6fa-4c60-a0a9-a15610885b6b",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "9de0aafd280640f8a49206bf61b36ed5",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().hasLabel('cell').properties().count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "f23d18bb-1ee8-4374-8197-1d0b8dc1e62b",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "3890d998c25c46a49c22923c394bd3e5",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.E().hasLabel('user_live_cell').properties().key().dedup().count() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "13594594-0ff0-42d5-a5b2-205c8a39860c",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "3a20c62ae01f48eeab8539f8429eceba",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.E().hasLabel('user_live_cell').properties().count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8a705292-849d-4a55-98ca-f75dd7b3892b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
