{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "25ced253-004d-4d9a-8a20-b6864c02ba7f",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Environment set up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1801c6e3-ad0f-4dc9-be8b-4c283834dadc",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# the endpoint generated by the cloudformation stack for neptune\n",
    "endpoint = 'to be copied from CF'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "dda89f43-076d-4445-a97b-a4693ccc1b88",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sagemaker.config INFO - Not applying SDK defaults from location: /etc/xdg/sagemaker/config.yaml\n",
      "sagemaker.config INFO - Not applying SDK defaults from location: /home/ec2-user/.config/sagemaker/config.yaml\n",
      "This Neptune cluster is configured to use Neptune ML\n"
     ]
    }
   ],
   "source": [
    "import neptune_ml_utils as neptune_ml\n",
    "neptune_ml.check_ml_enabled()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "623d4022-77e9-40e8-baf9-b13076260730",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.driver.aiohttp.transport import AiohttpTransport\n",
    "from gremlin_python.process.traversal import *\n",
    "from gremlin_python.process.graph_traversal import id_\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0caead1e-a98b-48c0-954a-9f5c86c8cdc8",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "s3_bucket_uri=\"s3://telcograph\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8201e497-ca16-4ad8-9819-d021d9d137b1",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "# Prepare the PoC for the Transductive mode\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "20a71b23-af17-4a48-9877-c9537354fac1",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "- drop some edges : Drop some links between some existing users and Cells to predict them with the transductive mode training.\n",
    "- training is already done and the model_transductive is available in the Endpoint\n",
    "- the transductive training take into account all users and cells properties as well as the user_live_cell properties. \n",
    "- for user_0 and cell_62000 we dropped ALL edges\n",
    "- for user_1500 and cell_56500 we dropped ALL edges  \n",
    "- for user_4570 three edges user_live_cell_1678350, user_live_cell_734598, user_live_cell_487137"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6123d8d1-a7dd-43c1-a4b6-9ce406cf5e01",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Select users to drop their user_live_cell edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "fe556883-1da6-4e96-98d4-1b01d727fa30",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "93857f00c2784489a10dd34be6a96622",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V()\n",
    ".hasId(\"user_0\")\n",
    ".outE()\n",
    ".hasLabel(\"user_live_cell\")\n",
    ".inV()\n",
    ".valueMap(true, \"name\")\n",
    ".groupCount()\n",
    ".unfold()\n",
    ".order()\n",
    ".by(values, desc)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "bdfddf87-df13-4fe4-acb8-ac1e5af66550",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "3e54c56d7d02479196b14e52d192b004",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_0').outE()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "c5540eba-2088-4c12-9116-a77ebb273d50",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "20e73d6fa8d64c43b0146b085cc4f941",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 18.51\n",
       "# of results                | 0\n",
       "Response size (bytes)       | 56\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"dc7cd93d-a2b3-4ea8-9ad5-f8ba273b5327\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#dc7cd93d-a2b3-4ea8-9ad5-f8ba273b5327').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_0').bothE().where(otherV().hasId('cell_62000'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6f0f42fa-0d22-4082-a867-1045e06b1c8f",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "#%%gremlin\n",
    "#g.V('user_0').bothE().where(otherV().hasId('cell_62000')).drop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "abe682e6-ef47-4f61-9313-59ddcbeda9d4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "92cdc1cdbd2b492cb8124c821129c9ae",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 28.33\n",
       "# of results                | 67\n",
       "Response size (bytes)       | 696\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"5d5a9489-5efc-4f63-8e71-6af5e6810f97\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [[1, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_18500&#39;}: 6}\"], [2, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_32500&#39;}: 6}\"], [3, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_1500&#39;}: 6}\"], [4, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_63500&#39;}: 6}\"], [5, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_25500&#39;}: 6}\"], [6, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_66500&#39;}: 5}\"], [7, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_28500&#39;}: 5}\"], [8, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_49500&#39;}: 5}\"], [9, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_31500&#39;}: 5}\"], [10, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_14500&#39;}: 5}\"], [11, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_35500&#39;}: 5}\"], [12, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_10500&#39;}: 5}\"], [13, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_6500&#39;}: 5}\"], [14, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_62500&#39;}: 5}\"], [15, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_39500&#39;}: 5}\"], [16, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_51500&#39;}: 5}\"], [17, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_24500&#39;}: 5}\"], [18, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_41500&#39;}: 5}\"], [19, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_45500&#39;}: 5}\"], [20, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_20500&#39;}: 5}\"], [21, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_3500&#39;}: 5}\"], [22, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_7500&#39;}: 5}\"], [23, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_42500&#39;}: 5}\"], [24, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_65500&#39;}: 5}\"], [25, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_27500&#39;}: 5}\"], [26, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_55500&#39;}: 5}\"], [27, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_61500&#39;}: 5}\"], [28, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_36500&#39;}: 5}\"], [29, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_13500&#39;}: 5}\"], [30, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_59500&#39;}: 5}\"], [31, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_17500&#39;}: 5}\"], [32, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_52500&#39;}: 5}\"], [33, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_46500&#39;}: 5}\"], [34, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_23500&#39;}: 5}\"], [35, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_4500&#39;}: 5}\"], [36, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_8500&#39;}: 5}\"], [37, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_64500&#39;}: 5}\"], [38, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_54500&#39;}: 5}\"], [39, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_12500&#39;}: 5}\"], [40, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_33500&#39;}: 5}\"], [41, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_60500&#39;}: 5}\"], [42, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_58500&#39;}: 5}\"], [43, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_37500&#39;}: 5}\"], [44, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_53500&#39;}: 5}\"], [45, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_43500&#39;}: 5}\"], [46, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_26500&#39;}: 5}\"], [47, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_16500&#39;}: 5}\"], [48, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_22500&#39;}: 5}\"], [49, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_47500&#39;}: 5}\"], [50, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_68500&#39;}: 5}\"], [51, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_67500&#39;}: 5}\"], [52, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_5500&#39;}: 5}\"], [53, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_15500&#39;}: 5}\"], [54, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_2500&#39;}: 5}\"], [55, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_30500&#39;}: 5}\"], [56, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_29500&#39;}: 5}\"], [57, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_34500&#39;}: 5}\"], [58, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_57500&#39;}: 5}\"], [59, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_11500&#39;}: 5}\"], [60, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_9500&#39;}: 5}\"], [61, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_38500&#39;}: 5}\"], [62, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_40500&#39;}: 5}\"], [63, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_50500&#39;}: 5}\"], [64, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_19500&#39;}: 5}\"], [65, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_44500&#39;}: 5}\"], [66, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_21500&#39;}: 5}\"], [67, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_48500&#39;}: 5}\"]];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#5d5a9489-5efc-4f63-8e71-6af5e6810f97').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V()\n",
    ".hasId(\"user_1500\")\n",
    ".outE()\n",
    ".hasLabel(\"user_live_cell\")\n",
    ".inV()\n",
    ".valueMap(true, \"name\")\n",
    ".groupCount()\n",
    ".unfold()\n",
    ".order()\n",
    ".by(values, desc)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "159dc9d0-2d9b-4b78-83cc-fb2f081948bf",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "84365c12f70d4207a86cc7387c82cf93",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 20.23\n",
       "# of results                | 0\n",
       "Response size (bytes)       | 56\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"e51432a1-a7ab-45ec-98c7-8fdf0006240f\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#e51432a1-a7ab-45ec-98c7-8fdf0006240f').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_1500').bothE().where(otherV().hasId('cell_56500'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "653b811a-1d06-4437-811a-8731f24d288f",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "795ecd4482f34fc3919700dbadc50a95",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 30.6\n",
       "# of results                | 67\n",
       "Response size (bytes)       | 696\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"082bca8d-e93f-4319-99f4-e97f0e1be569\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [[1, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_18500&#39;}: 6}\"], [2, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_32500&#39;}: 6}\"], [3, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_1500&#39;}: 6}\"], [4, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_63500&#39;}: 6}\"], [5, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_25500&#39;}: 6}\"], [6, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_66500&#39;}: 5}\"], [7, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_28500&#39;}: 5}\"], [8, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_49500&#39;}: 5}\"], [9, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_31500&#39;}: 5}\"], [10, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_14500&#39;}: 5}\"], [11, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_35500&#39;}: 5}\"], [12, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_10500&#39;}: 5}\"], [13, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_6500&#39;}: 5}\"], [14, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_62500&#39;}: 5}\"], [15, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_39500&#39;}: 5}\"], [16, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_51500&#39;}: 5}\"], [17, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_24500&#39;}: 5}\"], [18, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_41500&#39;}: 5}\"], [19, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_45500&#39;}: 5}\"], [20, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_20500&#39;}: 5}\"], [21, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_3500&#39;}: 5}\"], [22, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_7500&#39;}: 5}\"], [23, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_42500&#39;}: 5}\"], [24, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_65500&#39;}: 5}\"], [25, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_27500&#39;}: 5}\"], [26, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_55500&#39;}: 5}\"], [27, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_61500&#39;}: 5}\"], [28, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_36500&#39;}: 5}\"], [29, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_13500&#39;}: 5}\"], [30, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_59500&#39;}: 5}\"], [31, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_17500&#39;}: 5}\"], [32, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_52500&#39;}: 5}\"], [33, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_46500&#39;}: 5}\"], [34, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_23500&#39;}: 5}\"], [35, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_4500&#39;}: 5}\"], [36, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_8500&#39;}: 5}\"], [37, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_64500&#39;}: 5}\"], [38, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_54500&#39;}: 5}\"], [39, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_12500&#39;}: 5}\"], [40, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_33500&#39;}: 5}\"], [41, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_60500&#39;}: 5}\"], [42, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_58500&#39;}: 5}\"], [43, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_37500&#39;}: 5}\"], [44, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_53500&#39;}: 5}\"], [45, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_43500&#39;}: 5}\"], [46, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_26500&#39;}: 5}\"], [47, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_16500&#39;}: 5}\"], [48, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_22500&#39;}: 5}\"], [49, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_47500&#39;}: 5}\"], [50, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_68500&#39;}: 5}\"], [51, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_67500&#39;}: 5}\"], [52, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_5500&#39;}: 5}\"], [53, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_15500&#39;}: 5}\"], [54, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_2500&#39;}: 5}\"], [55, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_30500&#39;}: 5}\"], [56, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_29500&#39;}: 5}\"], [57, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_34500&#39;}: 5}\"], [58, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_57500&#39;}: 5}\"], [59, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_11500&#39;}: 5}\"], [60, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_9500&#39;}: 5}\"], [61, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_38500&#39;}: 5}\"], [62, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_40500&#39;}: 5}\"], [63, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_50500&#39;}: 5}\"], [64, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_19500&#39;}: 5}\"], [65, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_44500&#39;}: 5}\"], [66, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_21500&#39;}: 5}\"], [67, \"{{&lt;T.label: 4&gt;: &#39;cell&#39;, &lt;T.id: 1&gt;: &#39;cell_48500&#39;}: 5}\"]];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#082bca8d-e93f-4319-99f4-e97f0e1be569').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V()\n",
    ".hasId(\"user_1500\")\n",
    ".outE()\n",
    ".hasLabel(\"user_live_cell\")\n",
    ".inV()\n",
    ".valueMap(true, \"name\")\n",
    ".groupCount()\n",
    ".unfold()\n",
    ".order()\n",
    ".by(values, desc)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "3fb5fa63-3e41-4707-bb2a-c3fc0dbebce6",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "fc6b92f321da490b9e1ece4393dc7dfc",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 20.28\n",
       "# of results                | 3\n",
       "Response size (bytes)       | 88\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"68ce728e-a6ee-4a8f-9d2c-14a9fdc93da9\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [[1, \"e[user_live_cell_487137][user_4570-user_live_cell-&gt;cell_10570]\"], [2, \"e[user_live_cell_326296][user_4570-user_live_cell-&gt;cell_10570]\"], [3, \"e[user_live_cell_1654133][user_4570-user_live_cell-&gt;cell_10570]\"]];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#68ce728e-a6ee-4a8f-9d2c-14a9fdc93da9').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_4570').bothE().where(otherV().hasId('cell_10570'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "e6f2c848-4182-45b7-aa74-90dca1bc26b2",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "162572470b404cd09aa62dd337fbe853",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "    \n",
       "        <style>\n",
       "            #results-pre{\n",
       "                overflow: scroll;\n",
       "                font-size: 1em !important;\n",
       "                font-family: \"Courier New\", Courier, monospace !important;\n",
       "            }\n",
       "        </style>\n",
       "    \n",
       "    <pre id=\"results-pre\">Query mode                  | query\n",
       "Request execution time (ms) | 19.68\n",
       "# of results                | 0\n",
       "Response size (bytes)       | 56\n",
       "</pre>\n",
       "</div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<style>.itables table td {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables table th {\n",
       "    text-overflow: ellipsis;\n",
       "    overflow: hidden;\n",
       "}\n",
       "\n",
       ".itables thead input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "\n",
       ".itables tfoot input {\n",
       "    width: 100%;\n",
       "    padding: 3px;\n",
       "    box-sizing: border-box;\n",
       "}\n",
       "</style>\n",
       "<div class=\"itables\">\n",
       "<table id=\"14aca6db-2b7e-4606-8bca-09dc0ebb70b7\" class=\"display hover nowrap\"style=\"table-layout:auto;width:auto;margin:auto;caption-side:bottom\"><thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>#</th>\n",
       "      <th>Result</th>\n",
       "    </tr>\n",
       "  </thead><tbody><tr><td>Loading... (need <a href=https://mwouts.github.io/itables/troubleshooting.html>help</a>?)</td></tr></tbody></table>\n",
       "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css\">\n",
       "<script type=\"module\">\n",
       "    // Import jquery and DataTable\n",
       "    import 'https://code.jquery.com/jquery-3.6.0.min.js';\n",
       "    import dt from 'https://cdn.datatables.net/1.12.1/js/jquery.dataTables.mjs';\n",
       "    dt($);\n",
       "\n",
       "    // Define the table data\n",
       "    const data = [];\n",
       "\n",
       "    // Define the dt_args\n",
       "    let dt_args = {\"scrollX\": true, \"scrollY\": \"475px\", \"columnDefs\": [{\"width\": \"5%\", \"targets\": 0}, {\"visible\": true, \"targets\": 0}, {\"searchable\": false, \"targets\": 0}, {\"minWidth\": \"95%\", \"targets\": 1}, {\"className\": \"nowrap dt-left\", \"targets\": \"_all\"}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-weight', 'bold');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": 0}, {\"createdCell\": \n",
       "            function (td, cellData, rowData, row, col) {\n",
       "                $(td).css('font-family', 'monospace');\n",
       "                $(td).css('font-size', '12px');\n",
       "            }\n",
       "            , \"targets\": \"_all\"}], \"paging\": true, \"scrollCollapse\": true, \"lengthMenu\": [[10, 25, 50, 100, -1], [10, 25, 50, 100, \"All\"]], \"pageLength\": 10, \"order\": []};\n",
       "    dt_args[\"data\"] = data;\n",
       "\n",
       "    $(document).ready(function () {\n",
       "        \n",
       "        $('#14aca6db-2b7e-4606-8bca-09dc0ebb70b7').DataTable(dt_args);\n",
       "    });\n",
       "</script>\n",
       "</div>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_4570').outE('user_live_cell').hasId('user_live_cell_734598').drop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "5e56f57c-b1b7-47ad-8259-1875fcc6f63f",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "#%%gremlin\n",
    "#g.V('user_4570').outE('user_live_cell').hasId('user_live_cell_1678350').drop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "06a1109b-2611-4403-afa2-ef95dd617cc4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "a4fae506490d4145894d72479b753787",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('user_4570').bothE().where(otherV().hasId('cell_10570'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "83dacf9a-32a0-43e1-97f5-899d9db9e075",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "# Launch the export\n",
    "## Frame the link prediction task in the export_param"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "35700b4f-877b-4a0f-bd34-93e2b6602a7e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'command': 'export-pg',\n",
       " 'params': {'endpoint': 'cluster.cluster-c2wgvyuhzgmx.eu-west-1.neptune.amazonaws.com',\n",
       "  'profile': 'neptune_ml',\n",
       "  'useIamAuth': False,\n",
       "  'cloneCluster': False,\n",
       "  'nodeLabels': ['user', 'cell'],\n",
       "  'edgeLabels': ['user_live_cell']},\n",
       " 'outputS3Path': 's3://telcograph/neptune-export',\n",
       " 'additionalParams': {'neptune_ml': {'version': 'v2.0',\n",
       "   'targets': [{'edge': ['user', 'user_live_cell', 'cell'],\n",
       "     'type': 'link_prediction',\n",
       "     'split_rate': [0.8, 0.1, 0.1]}]}},\n",
       " 'jobSize': 'xlarge'}"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "export_params={ \n",
    "\"command\": \"export-pg\", \n",
    "\"params\": { \"endpoint\": neptune_ml.get_host(),\n",
    "            \"profile\": \"neptune_ml\",\n",
    "            \"useIamAuth\": neptune_ml.get_iam(),\n",
    "            \"cloneCluster\": False,\n",
    "            \"nodeLabels\": [\"user\", \"cell\"],\n",
    "            \"edgeLabels\": [\"user_live_cell\"]\n",
    "            }, \n",
    "\"outputS3Path\": f'{s3_bucket_uri}/neptune-export',\n",
    "\"additionalParams\": {\n",
    "        \"neptune_ml\": {\n",
    "          \"version\": \"v2.0\",\n",
    "          \"targets\": [\n",
    "            {\n",
    "                \"edge\": [\"user\", \"user_live_cell\", \"cell\"],\n",
    "                \"type\" : \"link_prediction\",\n",
    "                \"split_rate\": [0.8, 0.1, 0.1]\n",
    "            }\n",
    "         ]\n",
    "        }\n",
    "      },\n",
    "\"jobSize\": \"xlarge\"}\n",
    "export_params"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "6924afe8-9aa7-48a2-84f2-0bb3d2ca309c",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d5f3a813942d4b608f51e59895a62d9a",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Output()"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%neptune_ml export start --export-url {neptune_ml.get_export_service_host()} --export-iam --wait --store-to export_results\n",
    "${export_params}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "c614c7f5-92fd-40a6-a602-ef5ec2191a75",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "279c502e283249248486d741f2d58149",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Output()"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d17a42ddad424761a63e561578e3922a",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(overflow='scroll')),), _titles={'0': 'Error'})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# check the status\n",
    "%neptune_ml export status --export-url {neptune_ml.get_export_service_host()} --export-iam --job-id 4660f4dd-bcdf-4abe-949a-692ddd54f593"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b39de06e-072a-4ec8-93f1-09f9737d6958",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "# Data processing/Preparation of graph data for Training"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5ad2c500-7ad9-4734-9a0a-9b384cccf529",
   "metadata": {},
   "source": [
    "NB. Precise in export_param the S3 with the latest export to consider "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "28005585-0c10-49d7-842b-84fc57694eeb",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# The training_job_name can be set to a unique value below, otherwise one will be auto generated\n",
    "training_job_name=neptune_ml.get_training_job_name('link-prediction')\n",
    "\n",
    "processing_params = f\"\"\"\n",
    "--config-file-name training-data-configuration.json\n",
    "--job-id {training_job_name} \n",
    "--instance-type ml.r5.16xlarge\n",
    "--s3-input-uri s3://telcograph/neptune-export/20230518_072439\n",
    "--s3-processed-uri {str(s3_bucket_uri)}/preloading \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "4f03a052-7427-4a7a-adce-3657c5432249",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d57aaf670d0d4625b53bfbd39d7459f7",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Output()"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "fd68d011150942bf981e65f6e4496554",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(overflow='scroll')),), _titles={'0': 'Error'})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%neptune_ml dataprocessing start --wait --store-to processing_results {processing_params}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "45dc0584-9f3b-4d6d-be60-19603202cfa7",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Training "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e4b3f37-4328-4c16-af3d-24a293330c86",
   "metadata": {},
   "source": [
    "<div style=\"background-color:#eeeeee; padding:20px; text-align:left; border-radius:10px; margin-top:10px; margin-bottom:10px; \"><b>Information</b>: Link prediction is a more computationally complex model than classification or regression </div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38fc7d30-a76c-4cc3-a080-8607ef016ebb",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Transductive Training steps "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ed1e2cd2-220a-4cf7-82d7-9ce655860cfe",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'my-train-job-ept-hypmodv9'"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#check the Ids for training and processing jobs\n",
    "training_job_name = \"my-train-job-ept-hypmodv9\"\n",
    "training_job_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "649db2e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\"ids\":[\"link-prediction-1690116689\",\"link-prediction-1687117627\",\"link-prediction-1684928671\"]}"
     ]
    }
   ],
   "source": [
    "!curl -s \"https://cluster.cluster-c2wgvyuhzgmx.eu-west-1.neptune.amazonaws.com:8182/ml/dataprocessing/\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "46a55f3f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\"processingJob\":{\"name\":\"link-pre-preloading-2023-05-24-11-44-390000\",\"arn\":\"arn:aws:sagemaker:eu-west-1:134846823987:processing-job/link-pre-preloading-2023-05-24-11-44-390000\",\"status\":\"Completed\",\"outputLocation\":\"s3://telcograph/preloading/link-pre-preloading-2023-05-24-11-44-390000/preloading-output\"},\"id\":\"link-prediction-1684928671\",\"status\":\"Completed\"}"
     ]
    }
   ],
   "source": [
    "!curl -s \"https://cluster.cluster-c2wgvyuhzgmx.eu-west-1.neptune.amazonaws.com:8182/ml/dataprocessing/link-prediction-1684928671\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "2bb3284b-569e-4059-9cec-054085886c25",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "training_params=f\"\"\"\n",
    "--job-id {training_job_name}\n",
    "--data-processing-id {training_job_name}\n",
    "--instance-type ml.g4dn.16xlarge\n",
    "--s3-output-uri {str(s3_bucket_uri)}/training\n",
    "--max-hpo-number 1\n",
    "--max-hpo-parallel 3 \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8cd7b963-f308-4864-8fa1-fbb45b190b34",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "training_params"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "ae94cf64-5ddd-4753-bb35-03e035505d61",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d55d5a49095544f7b77fc257b492c35d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Output()"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%neptune_ml training start --wait --store-to training_results {training_params}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "5c48124c-2e5d-4b52-8c07-b40103e1f3dd",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\n--job-id my-train-job-ept-hypmodv9\\n--data-processing-id my-train-job-ept-hypmodv9\\n--instance-type ml.g4dn.16xlarge\\n--s3-output-uri s3://telcograph/training\\n--max-hpo-number 1\\n--max-hpo-parallel 3 '"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "training_params"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "93d920e4-e32a-42f5-9819-c711f847bea1",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "b90025e4de1e46c99cc0bfbef9468c0a",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Output()"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%neptune_ml training status --job-id my-train-job-ept-hypmodv9"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4d2721b4-a9f8-4651-83ae-cf863d5676c6",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Inference "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c3b6d3a9-5ab3-41f1-aabc-02e339ac77c8",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Endpoint creation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6e49871f-7035-4067-819c-473d99d53dd4",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "endpoint_params=f\"\"\"\n",
    "--id {training_job_name}\n",
    "--model-training-job-id {training_job_name}\"\"\"\n",
    "endpoint_params"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15929e73-ddf5-43e3-9b0f-5756fb442cf4",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "%neptune_ml endpoint create --wait --store-to endpoint_results {endpoint_params}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1e14a77e-0abd-4122-85bd-5f44fbaab317",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "endpoint_transductive=endpoint_results['endpoint']['name']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "3c81ec6c",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "endpoint_transductive ='my-train-2023-08-29-10-12-7520000-endpoint'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f0834412-cb3e-45e4-879d-ce6ec788f4db",
   "metadata": {
    "tags": []
   },
   "source": [
    "### reminder\n",
    "\n",
    "- user_0 and cell_62000 / dropped ALL edges \n",
    "\n",
    "- user_1500 and cell_56500 / dropped ALL edges \n",
    "\n",
    "- user_4570 three edges of cell_10570"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f9188948",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "import boto3\n",
    "import json\n",
    "import time\n",
    "\n",
    "def invoke_sagemaker_endpoint(endpoint_name, vertex_id, edge_type, head_node_type=None, tail_node_type=None, \n",
    "    exclude_flag='null', topk=10, response_format='application/json', region='eu-west-1'):\n",
    "    if tail_node_type:\n",
    "        input_data = {\n",
    "            \"version\": \"v1\",\n",
    "            \"mode\": \"predict_tail\",\n",
    "            \"data\": {\n",
    "                \"globalParameters\": {\n",
    "                    'topk': topk,\n",
    "                    'edgeType': edge_type,\n",
    "                    'tailNodeType': tail_node_type,\n",
    "                    'excludeFlag': exclude_flag\n",
    "                },\n",
    "                \"edges\": [\n",
    "                    {\n",
    "                        \"headNodeId\": vertex_id,\n",
    "                    }\n",
    "                ]\n",
    "            }\n",
    "        }\n",
    "    else:\n",
    "        input_data = {\n",
    "            \"version\": \"v1\",\n",
    "            \"mode\": \"predict_head\",\n",
    "            \"data\": {\n",
    "                \"globalParameters\": {\n",
    "                    'topk': topk,\n",
    "                    'edgeType': edge_type,\n",
    "                    'headNodeType': head_node_type,\n",
    "                    'excludeFlag': exclude_flag\n",
    "                },\n",
    "                \"edges\": [\n",
    "                    {\n",
    "                        \"tailNodeId\": vertex_id,\n",
    "                    }\n",
    "                ]\n",
    "            }\n",
    "        }\n",
    "    sagemaker_runtime = boto3.client('sagemaker-runtime', region_name=region)\n",
    "    payload = json.dumps(input_data)\n",
    "    tic = time.time()\n",
    "    response = sagemaker_runtime.invoke_endpoint(EndpointName=endpoint_name,\n",
    "                                                 ContentType='application/json',\n",
    "                                                 Accept=response_format,\n",
    "                                                 Body=payload)\n",
    "    duration = time.time() - tic\n",
    "    print()\n",
    "    output = json.loads(response['Body'].read().decode())[\"output\"]\n",
    "    for result in output[\"edges\"][0][\"mlResults\"]:\n",
    "        print(result['inferredValue'])\n",
    "    print(\"Inference took {} milliseconds\".format(duration*1000))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7bd4bd6-59d8-4b58-85d2-1652f3744559",
   "metadata": {
    "tags": []
   },
   "source": [
    "<img src=\"attachment:2a0d7696-5e11-42af-a56f-f7acc5d63572.png\" alt=\"image.png\" width=\"1000\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11f36eba-9509-432b-a1fe-ca0983ff5b4c",
   "metadata": {
    "tags": []
   },
   "source": [
    "## DEMO shows: how GNN predicts to which cells, given user will be connected or Predicting which users are going to connect to a given cell "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e8a16fad-e685-40e8-aa63-fdb1ae9d11ff",
   "metadata": {},
   "source": [
    "<div style=\"background-color:#eeeeee; padding:20px; text-align:left; border-radius:10px; margin-top:10px; margin-bottom:10px; \"><b>Experimentation1</b>: GNN is going to predict that user_0 is connected to cell_62000</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f7ef4d80-c28f-4126-a412-442c6ffe519d",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Keyboard interrupt detected.\n"
     ]
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.with(\"Neptune#ml.endpoint\",\"${endpoint_transductive}\")\n",
    ".with(\"Neptune#ml.limit\", 5)\n",
    ".V(\"cell_62000\")\n",
    ".in(\"user_live_cell\").with(\"Neptune#ml.prediction\").hasLabel(\"user\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e8cec68-1415-407f-bd5e-74ce11129b25",
   "metadata": {
    "tags": []
   },
   "source": [
    "<div style=\"background-color:#eeeeee; padding:20px; text-align:left; border-radius:10px; margin-top:10px; margin-bottom:10px; \"><b>Experimentation2</b>: GNN is going to predict that user_1500 is connected to cell_56500</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "0dee7675-7fe3-4541-8ac5-f20d2297ecaa",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "9ae60fc9ecef40ad8ef12fa0e7e36682",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.with(\"Neptune#ml.endpoint\",\"${endpoint_transductive}\")\n",
    ".with(\"Neptune#ml.limit\",10)\n",
    ".V(\"cell_56500\")\n",
    ".in(\"user_live_cell\").with(\"Neptune#ml.prediction\").hasLabel(\"user\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7959809-f20a-4a29-a454-a757b27360d8",
   "metadata": {
    "tags": []
   },
   "source": [
    "<div style=\"background-color:#eeeeee; padding:20px; text-align:left; border-radius:10px; margin-top:10px; margin-bottom:10px; \"><b>Experimentation3</b>: GNN is going to predict that user_1500 is connected to cell_63500</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "6d823a85-37ed-45ba-949e-f3298dff4c40",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "7b8e3c92cb1b4dfd83cba201328d3638",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.with(\"Neptune#ml.endpoint\",\"${endpoint_transductive}\")\n",
    ".with(\"Neptune#ml.limit\",5)\n",
    ".V(\"user_1500\")\n",
    ".out(\"user_live_cell\").with(\"Neptune#ml.prediction\").with(\"Neptune#ml.filterExistingEdges\").hasLabel(\"cell\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a0535ce-94d3-49ce-af3a-8495139e61a3",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "# end to end architecture for multi- scenario "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24859736-ed67-4278-97f3-2c0e354baf0d",
   "metadata": {},
   "source": [
    "<img src=\"attachment:f8b596d3-26cd-4127-aebb-132900d153db.png\" alt=\"image.png\" width=\"1000\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ff163b50-96d8-4f1c-96d4-eec3a0a0d94c",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Note on GNN evaluation \n",
    "\n",
    "- HITS@10 provides a measure of how often the model suggests the correct item within the top 10 recommendation\n",
    "\n",
    "- While MR gives an overall indication of how close the correct item is to the top of the list on average.\n",
    "\n",
    "- Sagemaker evaluate the model on the train and test set \n",
    "\n",
    "- Results on test set \n",
    "\n",
    "    * \"HITS at top 1 (HITS@1)\": 0.4010819758391616,\n",
    "    * \"HITS at top 10 (HITS@10)\": 0.9438622262173598,\n",
    "    * \"HITS at top 3 (HITS@3)\": 0.6301810418539388,\n",
    "    * \"mean rank (MR)\": 3.719502285632852,\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7fa01006-2d37-4636-9350-0f5a8e116e4c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
